zhanzr/XMC1100-Boot-Kit-Demo/lcd2004.c
#include <XMC1100.h>
#include <xmc_gpio.h>
#include <xmc_ccu4.h>
#include <xmc_scu.h>

#include "lcd2004.h"

/**< Configuration for HandleGLOBAL_CCU4_0 */
GLOBAL_CCU4_t GLOBAL_CCU4_0 =
{
  .module_frequency = 64000000U,  /**< CCU4 input clock frequency */
  .syncstart_trigger_msk = XMC_SCU_CCU_TRIGGER_CCU40, 
  .module_ptr = (XMC_CCU4_MODULE_t*) CCU40,      /**< CCU4 Module Pointer */
  .mcs_action = (XMC_CCU4_SLICE_MCMS_ACTION_t)XMC_CCU4_SLICE_MCMS_ACTION_TRANSFER_PR_CR,
  .is_initialized = false
};

static inline void RS_H(void)
{
		XMC_GPIO_SetOutputHigh(XMC_GPIO_PORT0, 0);	
}

static inline void RS_L(void)
{
		XMC_GPIO_SetOutputLow(XMC_GPIO_PORT0, 0);	
}

static inline void RW_H(void)
{
		XMC_GPIO_SetOutputHigh(XMC_GPIO_PORT0, 1);	
}

static inline void RW_L(void)
{
		XMC_GPIO_SetOutputLow(XMC_GPIO_PORT0, 1);	
}

static inline void E_H(void)
{
		XMC_GPIO_SetOutputHigh(XMC_GPIO_PORT0, 2);	
}

static inline void E_L(void)
{
		XMC_GPIO_SetOutputLow(XMC_GPIO_PORT0, 2);	
}

static inline void D4_H(void)
{
		XMC_GPIO_SetOutputHigh(XMC_GPIO_PORT0, 9);	
}

static inline void D4_L(void)
{
		XMC_GPIO_SetOutputLow(XMC_GPIO_PORT0, 9);	
}

static inline void D5_H(void)
{
		XMC_GPIO_SetOutputHigh(XMC_GPIO_PORT1, 1);	
}

static inline void D5_L(void)
{
		XMC_GPIO_SetOutputLow(XMC_GPIO_PORT1, 1);	
}

static inline void D6_H(void)
{
		XMC_GPIO_SetOutputHigh(XMC_GPIO_PORT1, 0);	
}

static inline void D6_L(void)
{
		XMC_GPIO_SetOutputLow(XMC_GPIO_PORT1, 0);	
}

static inline void D7_H(void)
{
		XMC_GPIO_SetOutputHigh(XMC_GPIO_PORT0, 7);	
}

static inline void D7_L(void)
{
		XMC_GPIO_SetOutputLow(XMC_GPIO_PORT0, 7);	
}

static inline uint32_t ReadD4(void)
{
	return XMC_GPIO_GetInput(XMC_GPIO_PORT0, 9);
}

static inline uint32_t ReadD5(void)
{
	return XMC_GPIO_GetInput(XMC_GPIO_PORT1, 1);
}

static inline uint32_t ReadD6(void)
{
	return XMC_GPIO_GetInput(XMC_GPIO_PORT1, 0);
}

static inline uint32_t ReadD7(void)
{
	return XMC_GPIO_GetInput(XMC_GPIO_PORT0, 7);
}

static inline void DB4_Wr(uint8_t dat)
{
		(0==(dat&0x08))?D7_L():D7_H();
		(0==(dat&0x04))?D6_L():D6_H();
		(0==(dat&0x02))?D5_L():D5_H();
		(0==(dat&0x01))?D4_L():D4_H();
}

void LCD_WaitAvail(void)
{
	DB4_Wr(0xff);

	RS_L(); 
	RW_H();
	E_H();
	while(0!=ReadD7())
	{
		__NOP();
	}
	E_L();	
}

void LCD_WrCmd_4 (uint8_t cmd)
{
	LCD_WaitAvail();
	__NOP();__NOP();

	RS_L(); 
	RW_L();   	
	DB4_Wr(cmd>>4);
	E_H();
	E_L();
	
	__NOP();__NOP();

	DB4_Wr(cmd);
	E_H();
	E_L();	
}

void LCD_WrDat_4 (uint8_t dat)
{
	LCD_WaitAvail();
	__NOP();__NOP();
	
	RS_H(); 
	RW_L();   	
	DB4_Wr(dat>>4);
	E_H();
	E_L();

	__NOP();__NOP();

	DB4_Wr(dat);
	E_H();
	E_L();		
}

void LCD_SetPos (uint8_t x, uint8_t y)
{	
	const static uint8_t pos_tab[] = {0x80, 0xc0, 0x94, 0xd4};
	
	LCD_WrCmd_4(pos_tab[x] + y);	
}

/* Initializes the slice with the generated configuration */
GLOBAL_CCU4_STATUS_t GLOBAL_CCU4_Init(GLOBAL_CCU4_t* handle)
{
  XMC_ASSERT("GLOBAL_CCU4_Init:NULL handler", (NULL != handle));

  if (false == handle->is_initialized)
  {
    /* Enable CCU4 module */
    XMC_CCU4_Init(handle->module_ptr,handle->mcs_action);
    /* Start the prescaler */
    XMC_CCU4_StartPrescaler(handle->module_ptr);
    /* Restricts multiple initializations */
    handle->is_initialized = true;
  }

  return (GLOBAL_CCU4_STATUS_SUCCESS);
}

__STATIC_INLINE void GLOBAL_CCU4_SyncStartTriggerHigh(uint32_t ccucon_msk)
{
  XMC_SCU_SetCcuTriggerHigh(ccucon_msk);
}

__STATIC_INLINE void GLOBAL_CCU4_SyncStartTriggerLow(uint32_t ccucon_msk)
{
  XMC_SCU_SetCcuTriggerLow(ccucon_msk);
}


    const XMC_CCU4_SLICE_COMPARE_CONFIG_t  PWM_CCU4_0_timer_handle =
    {
      .timer_mode            = (uint32_t)XMC_CCU4_SLICE_TIMER_COUNT_MODE_EA,
      .monoshot              = (uint32_t)XMC_CCU4_SLICE_TIMER_REPEAT_MODE_REPEAT,
      .shadow_xfer_clear     = 0U,
      .dither_timer_period   = 0U,
      .dither_duty_cycle     = 0U,

      .prescaler_mode        = (uint32_t)XMC_CCU4_SLICE_PRESCALER_MODE_NORMAL,

      .mcm_enable            = 0U,
      .prescaler_initval     = 0U,
      .dither_limit          = 0U,
      .timer_concatenation   = 0U,
      .passive_level         = (uint32_t)XMC_CCU4_SLICE_OUTPUT_PASSIVE_LEVEL_LOW, 
    };


    const XMC_CCU4_SLICE_EVENT_CONFIG_t PWM_CCU4_0_event0_config = 
    {
      .mapped_input        = XMC_CCU4_SLICE_INPUT_A,
      .edge                = XMC_CCU4_SLICE_EVENT_EDGE_SENSITIVITY_NONE,
      .level               = XMC_CCU4_SLICE_EVENT_LEVEL_SENSITIVITY_ACTIVE_LOW,
      .duration            = XMC_CCU4_SLICE_EVENT_FILTER_DISABLED,
    };

    const XMC_CCU4_SLICE_EVENT_CONFIG_t PWM_CCU4_0_event1_config = 
    {
      .mapped_input        = XMC_CCU4_SLICE_INPUT_A,
      .edge                = XMC_CCU4_SLICE_EVENT_EDGE_SENSITIVITY_NONE,
      .level               = XMC_CCU4_SLICE_EVENT_LEVEL_SENSITIVITY_ACTIVE_LOW,
      .duration            = XMC_CCU4_SLICE_EVENT_FILTER_DISABLED,
    };

    const XMC_CCU4_SLICE_EVENT_CONFIG_t PWM_CCU4_0_event2_config = 
    {
      .mapped_input        = XMC_CCU4_SLICE_INPUT_A,
      .edge                = XMC_CCU4_SLICE_EVENT_EDGE_SENSITIVITY_NONE,
      .level               = XMC_CCU4_SLICE_EVENT_LEVEL_SENSITIVITY_ACTIVE_LOW,
      .duration            = XMC_CCU4_SLICE_EVENT_FILTER_DISABLED,
    };


    const XMC_GPIO_CONFIG_t  PWM_CCU4_0_ch1_out0_config    =
    {
      .mode                = XMC_GPIO_MODE_OUTPUT_PUSH_PULL_ALT4,
      .input_hysteresis    = XMC_GPIO_INPUT_HYSTERESIS_STANDARD,
      .output_level        = XMC_GPIO_OUTPUT_LEVEL_LOW
    };

    const PWM_CCU4_CONFIG_t  PWM_CCU4_0_config_handle =
    {
      .start_control                       = true,      
      .period_value                        = 639U,
      .compare_value                       = 576U,

      .int_per_match                       = false,
      .int_cmp_match_up                    = false,
      .int_cmp_match_down                  = false,

      .int_one_match_down                  = false,
      .int_e0                              = false,
      .int_e1                              = false,
      .int_e2                              = false,

      .sr_per_match                        = XMC_CCU4_SLICE_SR_ID_0,
      .sr_cmp_match_up                     = XMC_CCU4_SLICE_SR_ID_0,
      .sr_cmp_match_down                   = XMC_CCU4_SLICE_SR_ID_0,

      .sr_one_match_down                   = XMC_CCU4_SLICE_SR_ID_0,
      .sr_e0                               = XMC_CCU4_SLICE_SR_ID_0,
      .sr_e1                               = XMC_CCU4_SLICE_SR_ID_0,
      .sr_e2                               = XMC_CCU4_SLICE_SR_ID_0,

      .event0_config_ptr                   = &PWM_CCU4_0_event0_config,
      .event1_config_ptr                   = &PWM_CCU4_0_event1_config,
      .event2_config_ptr                   = &PWM_CCU4_0_event2_config,

      .ext_start_event                     = XMC_CCU4_SLICE_EVENT_NONE,
      .ext_start_mode                      = XMC_CCU4_SLICE_START_MODE_TIMER_START,

      .ext_stop_event                      = XMC_CCU4_SLICE_EVENT_NONE,
      .ext_stop_mode                       = XMC_CCU4_SLICE_END_MODE_TIMER_STOP,

